renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_basic/src/hw/r_usb_rx_mcu.c
    }
    return USB_SUCCESS;
}
/******************************************************************************
End of function usb_module_start
******************************************************************************/

/******************************************************************************
 Function Name   : usb_module_stop
 Description     : USB module stop
 Arguments       : uint8_t ip_type  : USB_IP0/USB_IP1
 Return value    : none
 ******************************************************************************/
usb_err_t usb_module_stop (uint8_t ip_type)
{
    if (USB_IP0 == ip_type)
    {
        if (0 != MSTP(USB0))
        {
            return USB_ERR_NOT_OPEN;
        }

        USB0.DVSTCTR0.WORD = 0;
        USB0.DCPCTR.WORD = USB_SQSET;
        USB0.PIPE1CTR.WORD = 0;
        USB0.PIPE2CTR.WORD = 0;
        USB0.PIPE3CTR.WORD = 0;
        USB0.PIPE4CTR.WORD = 0;
        USB0.PIPE5CTR.WORD = 0;
        USB0.PIPE6CTR.WORD = 0;
        USB0.PIPE7CTR.WORD = 0;
        USB0.PIPE8CTR.WORD = 0;
        USB0.PIPE9CTR.WORD = 0;
        USB0.BRDYENB.WORD = 0;
        USB0.NRDYENB.WORD = 0;
        USB0.BEMPENB.WORD = 0;
        USB0.INTENB0.WORD = 0;
        USB0.INTENB1.WORD = 0;
        USB0.SYSCFG.WORD &= (~USB_DPRPU);
        USB0.SYSCFG.WORD &= (~USB_DRPD);
        USB0.SYSCFG.WORD &= (~USB_USBE);
        USB0.SYSCFG.WORD &= (~USB_DCFM);
        USB0.BRDYSTS.WORD = 0;
        USB0.NRDYSTS.WORD = 0;
        USB0.BEMPSTS.WORD = 0;

#if defined (BSP_MCU_RX72T)
        R_BSP_VoltageLevelSetting (BSP_VOL_USB_POWEROFF);
#endif  /* defined (BSP_MCU_RX72T) */

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

        /* Disable power for USB0 */
        MSTP(USB0) = 1;

        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
    }
    else if (USB_IP1 == ip_type)
    {
#if defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
        if (0 != MSTP(USBA))
        {
            return USB_ERR_NOT_OPEN;
        }

        USBA.DVSTCTR0.WORD = 0;
        USBA.DCPCTR.WORD = USB_SQSET;
        USBA.PIPE1CTR.WORD = 0;
        USBA.PIPE2CTR.WORD = 0;
        USBA.PIPE3CTR.WORD = 0;
        USBA.PIPE4CTR.WORD = 0;
        USBA.PIPE5CTR.WORD = 0;
        USBA.PIPE6CTR.WORD = 0;
        USBA.PIPE7CTR.WORD = 0;
        USBA.PIPE8CTR.WORD = 0;
        USBA.PIPE9CTR.WORD = 0;
        USBA.BRDYENB.WORD = 0;
        USBA.NRDYENB.WORD = 0;
        USBA.BEMPENB.WORD = 0;
        USBA.INTENB0.WORD = 0;
        USBA.INTENB1.WORD = 0;
        USBA.SYSCFG.WORD &= (~USB_DPRPU);
        USBA.SYSCFG.WORD &= (~USB_DRPD);
        USBA.SYSCFG.WORD &= (~USB_USBE);
        USBA.SYSCFG.WORD &= (~USB_DCFM);
        USBA.BRDYSTS.WORD = 0;
        USBA.NRDYSTS.WORD = 0;
        USBA.BEMPSTS.WORD = 0;

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

        /* Disable power for USBA */
        MSTP(USBA) = 1;

        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

#endif  /* defined (BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */

#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
        if (0 != MSTP(USB1))
        {
            return USB_ERR_NOT_OPEN;
        }

        USB1.DVSTCTR0.WORD = 0;
        USB1.DCPCTR.WORD = USB_SQSET;
        USB1.PIPE1CTR.WORD = 0;
        USB1.PIPE2CTR.WORD = 0;
        USB1.PIPE3CTR.WORD = 0;
        USB1.PIPE4CTR.WORD = 0;
        USB1.PIPE5CTR.WORD = 0;
        USB1.PIPE6CTR.WORD = 0;
        USB1.PIPE7CTR.WORD = 0;
        USB1.PIPE8CTR.WORD = 0;
        USB1.PIPE9CTR.WORD = 0;
        USB1.BRDYENB.WORD = 0;
        USB1.NRDYENB.WORD = 0;
        USB1.BEMPENB.WORD = 0;
        USB1.INTENB0.WORD = 0;
#if defined (BSP_MCU_RX62N)
        USB1.INTENB1.WORD = 0;
#endif /* defined (BSP_MCU_RX62N) */
        USB1.SYSCFG.WORD &= (~USB_DPRPU);
        USB1.SYSCFG.WORD &= (~USB_DRPD);
        USB1.SYSCFG.WORD &= (~USB_USBE);
        USB1.SYSCFG.WORD &= (~USB_DCFM);
        USB1.BRDYSTS.WORD = 0;
        USB1.NRDYSTS.WORD = 0;
        USB1.BEMPSTS.WORD = 0;

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

        /* Disable power for USB1 */
        MSTP(USB1) = 1;

        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */
    }
    else
    {
        return USB_ERR_PARA;
    }
    return USB_SUCCESS;
}
/******************************************************************************
End of function usb_module_stop
******************************************************************************/

/******************************************************************************
 Function Name   : usb_cpu_usbint_init
 Description     : USB interrupt Initialize
 Arguments       : uint8_t ip_type  : USB_IP0/USB_IP1
 Return value    : void
 ******************************************************************************/
void usb_cpu_usbint_init (uint8_t ip_type)
{
    if ( USB_IP0 == ip_type)
    {
#if (!defined (BSP_MCU_RX63T)) && (!defined (BSP_MCU_RX72T))
        /* Deep standby USB monitor register
         b0      SRPC0    USB0 single end control
         b3-b1   Reserved 0
         b4      FIXPHY0  USB0 transceiver output fix
         b7-b5   Reserved 0
         b8      SRPC1    USB1 single end control
         b11-b9  Reserved 0
         b12     FIXPHY1  USB1 transceiver output fix
         b15-b13 Reserved 0
         b16     DP0      USB0 DP input
         b17     DM0      USB0 DM input
         b19-b18 Reserved 0
         b20     DOVCA0   USB0 OVRCURA input
         b21     DOVCB0   USB0 OVRCURB input
         b22     Reserved 0
         b23     DVBSTS0  USB1 VBUS input
         b24     DP1      USB1 DP input
         b25     DM1      USB1 DM input
         b27-b26 Reserved 0
         b28     DOVCA1   USB1 OVRCURA input
         b29     DOVCB1   USB1 OVRCURB input
         b30     Reserved 0
         b31     DVBSTS1  USB1 VBUS input
         */
        USB.DPUSR0R.BIT.FIXPHY0 = 0u; /* USB0 Transceiver Output fixed */
#endif /* (!defined (BSP_MCU_RX63T)) && (!defined (BSP_MCU_RX72T)) */

        /* Interrupt enable register
         b0 IEN0 Interrupt enable bit
         b1 IEN1 Interrupt enable bit
         b2 IEN2 Interrupt enable bit
         b3 IEN3 Interrupt enable bit
         b4 IEN4 Interrupt enable bit
         b5 IEN5 Interrupt enable bit
         b6 IEN6 Interrupt enable bit
         b7 IEN7 Interrupt enable bit
         */
#if ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE))
        IEN (USB0, D0FIFO0) = 1u;    /* D0FIFO0 Enable */
        IEN (USB0, D1FIFO0) = 1u;    /* D1FIFO0 Enable */

#endif  /* ((USB_CFG_DTC == USB_CFG_ENABLE) || (USB_CFG_DMA == USB_CFG_ENABLE)) */

