renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_basic/src/hw/r_usb_rx_mcu.c
#if defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N)
/******************************************************************************
Function Name   : usb2_cpu_usb_int_hand_isr
Description     :
Arguments       : none
Return value    : none
******************************************************************************/
void usb2_cpu_usb_int_hand_isr(void)
{
    hw_usb_pclear_sts_resm();
    IPR (USB, USBR1) = 0x00;   /* Priority Resume1=0 */
    IR (USB, USBR1) = 0;      /* Interrupt Request USB_resume USBR1 Clear */
}   /* eof usb2_cpu_usb_int_hand_isr() */
#endif  /* defined (BSP_MCU_RX63N) || defined (BSP_MCU_RX62N) */

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */


#if USB_CFG_DTC == USB_CFG_ENABLE
/******************************************************************************
Function Name   : usb_cpu_d0fifo_int_hand
Description     : D0FIFO interrupt Handler
Arguments       : none
Return value    : none
******************************************************************************/
static void usb_cpu_d0fifo_int_hand(void)
{
    IPR (USB0,D0FIFO0) = 0;
    usb_cstd_dma_send_complete(USB_IP0, USB_D0USE);
}
/******************************************************************************
End of function usb_cpu_d0fifo_int_hand
******************************************************************************/

/******************************************************************************
Function Name   : usb_cpu_d1fifo_int_hand
Description     : D0FIFO interrupt Handler
Arguments       : none
Return value    : none
******************************************************************************/
static void usb_cpu_d1fifo_int_hand(void)
{
    IPR (USB0,D1FIFO0) = 0;
    usb_cstd_dma_send_complete(USB_IP0, USB_D1USE);
}
/******************************************************************************
End of function usb_cpu_d1fifo_int_hand
******************************************************************************/

#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX63N)
/******************************************************************************
Function Name   : usb2_cpu_d0fifo_int_hand
Description     : D0FIFO interrupt Handler
Arguments       : none
Return value    : none
******************************************************************************/
static void usb2_cpu_d0fifo_int_hand(void)
{
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    IPR (USBA,D0FIFO2) = 0;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
    IPR (USB1,D0FIFO1) = 0;

#endif  /* defined(BSP_MCU_RX63N) */
    usb_cstd_dma_send_complete(USB_IP1, USB_D0USE);
}
/******************************************************************************
End of function usb2_cpu_d0fifo_int_hand
******************************************************************************/

/******************************************************************************
Function Name   : usb2_cpu_d1fifo_int_hand
Description     : D0FIFO interrupt Handler
Arguments       : none
Return value    : none
******************************************************************************/
static void usb2_cpu_d1fifo_int_hand(void)
{
#if defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M)
    IPR (USBA,D1FIFO2) = 0;

#endif  /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) */
#if defined(BSP_MCU_RX63N)
    IPR (USB1,D1FIFO1) = 0;

#endif  /* defined(BSP_MCU_RX63N) */
    usb_cstd_dma_send_complete(USB_IP1, USB_D1USE);
}
/******************************************************************************
End of function usb2_cpu_d1fifo_int_hand
******************************************************************************/
#endif /* defined(BSP_MCU_RX64M) || defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX63N) */


#endif  /* USB_CFG_DTC == USB_CFG_ENABLE */

/******************************************************************************
Function Name   : usb_check_use_usba_module
Description     : 
Arguments       : usb_utr_t *ptr     : Pointer to usb_utr_t structure
Return value    : 
******************************************************************************/
bool usb_check_use_usba_module(usb_utr_t *ptr)
{
    bool    ret_code = false;

#if defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX64M)
    if (USB_NULL == ptr)
    {
    #if ((USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_PERI)
        #if USB_CFG_USE_USBIP == USB_CFG_IP1
        ret_code = true;
        #endif  
    #endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */
    }
    else
    {
        if (USB_IP1 == ptr->ip)
        {
            ret_code = true;
        }
    }
#endif  /* !defined(BSP_MCU_RX71M) || defined(BSP_MCU_RX64M) */

    return ret_code;
}   /* End of function usb_check_use_usba_module */

/******************************************************************************
 End  Of File
 ******************************************************************************/
